#!/usr/bin/env python3
# by Pavel Pavlov (c) 2016
# My second  program on Python 3

import sys

# задаем матрицы цифр
Zero = ["  ***  ", " *   * ", "*     *", "*     *", "*     *", " *   * ",
        "  ***  "]
One = ["    *  ", "   **  ", "  * *  ", "    *  ", "    *  ", "    *  ",
       "   *** "]
Two = ["  ***  ", " *   * ", " *   * ", "    *  ", "   *   ", "  *    ",
       " ******"]
Three = ["  ***  ", " *   * ", "     * ", "   **  ", "     * ", " *   * ",
         "  ***  "]
Four = ["     * ", "   * * ", "  *  * ", " *   * ", " ******", "     * ",
        "     * "]
Five = [" ****  ", " *     ", " *     ", "  ***  ", "     * ", " *   * ",
        "  ***  "]
Six = ["  ***  ", " *     ", " *     ", "  ***  ", " *   * ", " *   * ",
       "  ***  "]
Seven = [" ***** ", "     * ", "    *  ", "   *   ", "   *   ", "   *   ",
         "   *   "]
Eight = ["  ***  ", " *   * ", " *   * ", "  ***  ", " *   * ", " *   * ",
         "  ***  "]
Nine = ["  ***  ", " *   * ", " *   * ", "  ***  ", "     * ", "     * ",
        "  ***  "]

# список списков - список из матриц цифр

Digits = [Zero, One, Two, Three, Four, Five, Six, Seven, Eight, Nine]

try:
    digits = sys.argv[1]  # digits - это строка введеная как аргумент
    row = 0  # ставим на  ноль счетчик строк
    while row < 7:  # открываем цикл в 7 итераций для каждой строчки матрицы
        line = ""
        column = 0
        while column < len(digits):  # открываем цикл равный длине введеного числа (строка)
            number = int(digits[column])  # переводим строку в число каждую цифру числа
            digit = Digits[number]  # digit принимает значение списка звездочек для нужной цифры
            char = ""
            for char in digit[row]:
                if char == "*":
                    line += str(number)
                else:
                    line += " "
            #line += digit[row] + " "  # line формирует линию звездочек для всех цифр через пробел
            column += 1  # переходим к следующей цифре введеного числа
        print(line)  # печатаем очередную строчку звездочек для всех цифр в числе
                     # и переходим на новую строку
        row += 1  # переходим к следующей строке
# обработчик ошибок
except IndexError:
    print("usage: bigdigits.py <number>")
except ValueError as err:
    print(err, "in", digits)
